In [1]:
# Import the pandas and openpyxl package:
import pandas as pd

# Read the CSV file into a DataFrame:
df = pd.read_csv('Archivos_CSV/01_Iris.csv')
df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

# Next Demonstration: Importing Car Data

In [2]:
df2 =  pd.read_csv('Archivos_CSV/02_Cars.csv')
df2

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

# Inspecting the Cars Data with the Info Method:

In [3]:
# Instantiating the info() of the Car data:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Car_Name       5 non-null      object
 1   Year           5 non-null      int64
 2   Selling_Price  5 non-null      float64
 3   Present_Price  5 non-null      float64
 4   Kms_Driven     5 non-null      int64
 5   Fuel_Type      5 non-null      object
 6   Seller_Type    5 non-null      object
 7   Transmission   5 non-null      object
 8   Owner          5 non-null      int64
dtypes: float64(2), int64(3), object(4)
memory usage: 492.0+ bytes

# Examine Further Details on the Car Data:

In [4]:
# Instantiating describe() on the Car data:
df2.describe()

              Year  Selling_Price  Present_Price    Kms_Driven  Owner
count     5.000000       5.000000       5.000000      5.000000    5.0
mean   2013.800000       4.560000       7.200000  24910.000000    0.0
std       2.167948       1.707484       2.474955  18385.537795    0.0
min    2011.000000       2.850000       4.150000   5200.000000    0.0
25%    2013.000000       3.350000       5.590000   6900.000000    0.0
50%    2014.000000       4.600000       6.870000  27000.000000    0.0
75%    2014.000000       4.750000       9.540000  42450.000000    0.0
max    2017.000000       7.250000       9.850000  43000.000000    0.0

# Usando count para el conteo y sum para la suma

In [5]:
# Using count 
df2.count()

Car_Name         5
Year             5
Selling_Price    5
Present_Price    5
Kms_Driven       5
Fuel_Type        5
Seller_Type      5
Transmission     5
Owner            5
dtype: int64

In [6]:
# Using sum
df2.sum()

Car_Name                ritzsx4ciazwagon rswift
Year                                      10069
Selling_Price                              22.8
Present_Price                              36.0
Kms_Driven                               124550
Fuel_Type        PetrolDieselPetrolPetrolDiesel
Seller_Type      DealerDealerDealerDealerDealer
Transmission     ManualManualManualManualManual
Owner                                         0
dtype: object

# Using the df.sort_values()

In [7]:
# Order to min value
df2.sort_values('Year', ascending=False)

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0

In [9]:
# Order to max value
df2.sort_values('Year', ascending=True)
print(df2.Year)

0    2014
1    2013
2    2017
3    2011
4    2014
Name: Year, dtype: int64

# Using df.groupby()

In [10]:
df2.groupby('Year').sum()

,Car_Name,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
Year,,,,,,,,
2011,wagon r,2.85,4.15,5200,Petrol,Dealer,Manual,0
2013,sx4,4.75,9.54,43000,Diesel,Dealer,Manual,0
2014,ritzswift,7.95,12.46,69450,PetrolDiesel,DealerDealer,ManualManual,0
2017,ciaz,7.25,9.85,6900,Petrol,Dealer,Manual,0